#+TITLE:   Sequential and Distributed runs to solve Problem #4 from Project Euler, written in Org mode Babel mode
#+startup: showeverything

[[https://projecteuler.net/problem=4][Problem #4]] from Project Euler reads as follows:

#+begin_quote
A palindromic number reads the same both ways. 
The largest palindrome made from the product of two 2-digit numbers is 9009 = 91 × 99.
Find the largest palindrome made from the product of two 3-digit numbers.
#+end_quote

We can notice the following from the problem:

- The definition of a palindrome :: 
     Can be implemented considering that the reverse list of chars should be identical to the original list.

- There is exponential growth :: 
     We look for the largest palindrome in the range of 3 digit numbers (100 - 999). 
     For this, we iterate 2 times on the range, multiply the entries and make the palindrome check.

*** First implementation: Sequential run to find the largest palindrome

A straightforward implementation of the problem is by iterating twice
over the same range and grabbing the highest largest number:

#+name: sequential_palindrome_check
#+begin_src ruby :results output
require 'benchmark'

def palindrome_check(number)
  digits = number.to_s.split('').map(&:to_i)
  reverse_is_equal = digits == digits.reverse ? true : false

  reverse_is_equal
end

SMALLEST_NUMBER = 100
LARGEST_NUMBER  = 999

last_palindrome = 0
last_x = 0
last_y = 0
bm = Benchmark.measure do
  SMALLEST_NUMBER.upto(LARGEST_NUMBER).each do |i|
    SMALLEST_NUMBER.upto(LARGEST_NUMBER).each do |j|

      product = i * j
      is_palindrome = palindrome_check(product)
      if is_palindrome and product > last_palindrome
        last_palindrome = product 
        last_x = i
        last_y = j
      end
    end
  end
end

puts "The largest palindrome within this range is: #{last_palindrome} (x: #{last_x}, y: #{last_y}) and it took #{bm}"
#+end_src

#+RESULTS:
: The largest palindrome within this range is: 906609 (x: 913, y: 993) and it took 16.36000

For 3 digits, this approach seems like good enough. But what if we
want to find out the largest palindrome number with 4 digits? Since
growth is exponential, running this in a single process will take a
while to finish.

